function [ Data ] = HstgrmAutoStretch( Data, K ,minBrghtns, maxBrghtns) 
%HSTGRMAUTOSTRETCH Преднозначена для атоматической коррекции изображения,
% так чтобы его гистограмма яркостей оказалась растянута в максимумах
% и сжата в минимумах. (гистограмма должна быть центрирована)
%K - глубина обработки - 0 - передаточная функция линейна, 1 - 100% та что получена из гистограммы
if K>1||K<0
    error('Глубина обработки определена на интервале от 0 до 1');
end
Nnodes=128;  %Количество узлов для задания передаточной функции
Hstgrm=BldHstgrm( Data, Nnodes ,minBrghtns, maxBrghtns);    %Получение гистограммы (одновременнос с усреднением)
    %plot(Hstgrm);
StrNodes=cumsum(Hstgrm./sum(Hstgrm));   %количества пикселей в узлах. (Здесь считается, что количество точек эквивалентно количеству информации на снимке(в этом диапазоне яркостей).
    % Поэтому кол-во информации соответствует местной производной передаточной функции (разнице между соседними узлами))
StrFunc=zeros(2*Nnodes+1,1);    %Инициализация начального приближени для передаточной функции
i=2:2:2*Nnodes;	%Итератор для обращения к чётным элементам передаточной ф-ии
StrFunc(i)=StrNodes;    %Копирование значений узлов
i=i+1;
i(end)=[];      %Итератор для нечётных элементов передаточной ф-ии (кроме первого и последнего - первый всегда 0, последний всегда 1)
nodesX=0:0.5/Nnodes:1;  %Вектор аргументов начальногго приближения передаточной ф-ии (для интерполяции нужен равномерный шаг, поэтому кроме крайних значений (0 и 1) количество узлов удваивается)
StrFunc(i)=(StrFunc(i-1)+StrFunc(i+1))/2;   %Добавление промеуточных узлов (в линейном приближении)
StrFunc(end)=1;         %Установка последнего значения в 1 (до сих пор передаточная ф-ия задана в масштабе 0-1 и по X и по Y)
LinearFunc=nodesX;      %Инициализация линейной ф-ии
StrFunc=StrFunc'.*(K)+LinearFunc.*(1-K);  %Смешение передаточной функции с линейной в пропорции определённой К
X=minBrghtns:maxBrghtns;%Масштабировании передаточной ф-ии по оси аргументов
nodesX=nodesX.*(maxBrghtns-minBrghtns); %Масштабирование по оси Y
StrFunc=interp1(nodesX,StrFunc,X,'spline');     %Интерполяция промежуточных значений (аргументы протабулированы на каждое возможное значение яркости)
StrFunc=uint16(round(StrFunc.*(maxBrghtns-minBrghtns)));%Округление значений передаточной ф-ии (теперь она возвращает только целые значения)    
    %plot(StrFunc);
    %tic
Data=StrFunc(Data+1+minBrghtns);    %Применение передаточной функции к массиву данных (изображению)
    %toc
    %Hstgrm=BldHstgrm( Data, maxBrghtns-minBrghtns ,minBrghtns, maxBrghtns);
    %plot(Hstgrm)
end

